app/Controllers/Home.php

    public function kas()
    {
        $ModelKasMasjid = new \App\Models\ModelKasMasjid();
        $ModelKasSosial = new \App\Models\ModelKasSosial();
        $data = [
            'ModelKasMasjid' => $ModelKasMasjid->findAll(),
            'ModelKasSosial' => $ModelKasSosial->findAll(),
            'judul' => 'Home',
            'page' => 'v_kas',
        ];
---
SELECT *
FROM `tbl_kas_masjid`
SELECT *
FROM `tbl_kas_sosial`