app/Controllers/LaporanKasController.php

SELECT *
FROM `tbl_kas_masjid`
---
    public function masjid()
    {
        $this->data['page'] = 'laporan_kas/masjid';
        $this->data['data'] = $this->ModelKasMasjid->findAll();

SELECT *
FROM `tbl_kas_sosial`
---
    public function sosial()
    {
        $this->data['page'] = 'laporan_kas/sosial';
        $this->data['data'] = $this->ModelKasSosial->findAll();

SELECT *
FROM `tbl_kas_masjid`
WHERE EXTRACT(MONTH FROM tanggal) = '7'
---
    public function printMasjid()
    {
        $bulan = $this->request->getPost('bulan');
        $tahun = $this->request->getPost('tahun');
        if (empty($bulan) && empty($tahun)) {
            $data = [
                'data' => $this->ModelKasMasjid->findAll(),
            ];
        } elseif (empty($bulan)) {
            $data = [
                'data' => $this->ModelKasMasjid
                    ->where('EXTRACT(YEAR FROM tanggal) =', $tahun)
                    ->findAll(),
            ];
        } elseif (empty($tahun)) {
            $data = [
                'data' => $this->ModelKasMasjid
                    ->where('EXTRACT(MONTH FROM tanggal) =', $bulan)
                    ->findAll(),
            ];

SELECT *
FROM `tbl_kas_sosial`
WHERE EXTRACT(MONTH FROM tanggal) = '2'
---
    public function printSosial()
    {
        $bulan = $this->request->getPost('bulan');
        $tahun = $this->request->getPost('tahun');
        if (empty($bulan) && empty($tahun)) {
            $data = [
                'data' => $this->ModelKasSosial->findAll(),
            ];
        } elseif (empty($bulan)) {
            $data = [
                'data' => $this->ModelKasMasjid
                    ->where('EXTRACT(YEAR FROM tanggal) =', $tahun)
                    ->findAll(),
            ];
        } elseif (empty($tahun)) {
            $data = [
                'data' => $this->ModelKasSosial
                    ->where('EXTRACT(MONTH FROM tanggal) =', $bulan)
                    ->findAll(),
            ];