app/Controllers/UangKasSosialController.php

SELECT *
FROM `tbl_kas_sosial`
---
    public function __construct()
    {
        $this->ModelKasSosial = new ModelKasSosial();
        $this->data = [
            'judul' => 'Kas Masuk',
            'subjudul' => '',
            'menu' => 'Kas Masuk',
            'sub-menu' => '',
            'page' => 'uang_kas_sosial/index',
            'data' => $this->ModelKasSosial->findAll(),

SELECT SUM(`kas_masuk`) AS `kas_masuk`
FROM `tbl_kas_sosial`
 LIMIT 1
---
    public function rekap()
    {
        $this->data['judul'] = "Rekap";
        $this->data['menu'] = "Rekap";
        $this->data['page'] = "uang_kas_sosial/rekap";
        $this->data['total_masuk'] = $this->ModelKasSosial->selectSum('kas_masuk')->first();
        $this->data['total_keluar'] = 0;
        $this->data['total_uang'] = $this->ModelKasSosial->selectSum('kas_masuk')->first();

SELECT *
FROM `tbl_kas_sosial`
---
    public function print(){
        $data = [
            'data' => $this->ModelKasSosial->findAll(),
        ];