app/Controllers/UangKasMasjidController.php

SELECT *
FROM `tbl_kas_masjid`
---
    public function __construct()
    {
        $this->ModelKasMasjid = new ModelKasMasjid();
        $this->data = [
            'judul' => 'Kas Masuk',
            'subjudul' => '',
            'menu' => 'Kas Masuk',
            'sub-menu' => '',
            'page' => 'uang_kas_masjid/index',
            'data' => $this->ModelKasMasjid->findAll(),

SELECT SUM(`kas_masuk`) AS `kas_masuk`
FROM `tbl_kas_masjid`
 LIMIT 1
---
    public function rekap(){
        $this->data['judul'] = "Rekap";
        $this->data['menu'] = "Rekap";
        $this->data['page'] = "uang_kas_masjid/rekap";
        $this->data['total_masuk'] = $this->ModelKasMasjid->selectSum('kas_masuk')->first();
        $this->data['total_keluar'] = 0;
        $this->data['total_uang'] = $this->ModelKasMasjid->selectSum('kas_masuk')->first();